In [1]:
import pandas as pd

In [62]:
fact_data = pd.read_excel("G:\HDA5\e-commerece_data.xlsx")
fact_data.head(10)

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.00,35.00
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.00,26.00
2,P030,C007261,T03633,I00195,S00496,8,ct,12.50,100.00
3,P032,C007048,T084631,I00131,S0086,8,ct,14.00,112.00
4,P014,C006430,T071276,I00050,S00488,8,cans,8.00,64.00
5,P006,C007574,T026950,I00058,S00328,5,bottles,22.00,110.00
6,P023,C005695,T096704,I00075,S00196,2,cans,15.50,31.00
7,P027,C008728,T010756,I00188,S0010,1,ct,14.00,14.00
8,P025,C002764,T017598,I00017,S00164,11,cans,6.75,74.25
9,P019,C003128,T048812,I00133,S00640,10,ct,15.00,150.00

In [4]:
data.info()
# data.describe
# data.unit

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 9 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   payment_key    1000000 non-null  object
 1   coustomer_key  1000000 non-null  object
 2   time_key       1000000 non-null  object
 3   item_key       1000000 non-null  object
 4   store_key      1000000 non-null  object
 5   quantity       1000000 non-null  int64
 6   unit           996277 non-null   object
 7   unit_price     1000000 non-null  float64
 8   total_price    1000000 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 68.7+ MB

In [27]:
customer_dim = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Coustomer_dim.csv")
fact_data = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Fact_data.csv")
item_data = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Item_dim.csv")
store_data = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Store_dim.csv")
time_data = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Time_dim.csv")
trans_data = pd.read_csv("G:\HDA5\ecommerce_csv-20220815T045113Z-001\ecommerce_csv\Trans_dim.csv")

In [6]:
customer_dim.head()

  coustomer_key             name    contact_no           nid
0       C000001            sumit  8.801920e+12  7.505080e+12
1       C000002         tammanne  8.801817e+12  1.977730e+12
2       C000003    kailash kumar  8.801660e+12  3.769490e+12
3       C000004  bhagwati prasad  8.801534e+12  9.378830e+12
4       C000005             ajay  8.801944e+12  3.540820e+12

In [7]:
customer_dim.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9191 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9191 non-null   object
 1   name           9164 non-null   object
 2   contact_no     9191 non-null   float64
 3   nid            9191 non-null   float64
dtypes: float64(2), object(2)
memory usage: 287.3+ KB

In [61]:
fact_data.head()

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

In [9]:
fact_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   payment_key  39 non-null     object
 1   trans_type   39 non-null     object
 2   bank_name    39 non-null     object
dtypes: object(3)
memory usage: 1.0+ KB

In [10]:
item_data.head(10)

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans
5,I00006,Coke Classic 12 oz cans,a. Beverage - Soda,16.25,Lithuania,BIGSO AB,cans
6,I00007,Coke Classic 12 oz cans,a. Beverage - Soda,6.75,India,Indo Count Industries Ltd,cans
7,I00008,Coke Zero Sugar 12 oz cans,a. Beverage - Soda,16.25,India,Indo Count Industries Ltd,cans
8,I00009,Diet Coke - 12 oz cans,a. Beverage - Soda,16.25,Netherlands,Bolsius Boxmeer,cans
9,I00010,Diet Coke - 12 oz cans,a. Beverage - Soda,6.75,Lithuania,BIGSO AB,cans

In [11]:
item_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_key     264 non-null    object
 1   item_name    264 non-null    object
 2   desc         264 non-null    object
 3   unit_price   264 non-null    float64
 4   man_country  264 non-null    object
 5   supplier     264 non-null    object
 6   unit         263 non-null    object
dtypes: float64(1), object(6)
memory usage: 14.6+ KB

In [12]:
store_data.head()

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

In [13]:
store_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 726 entries, 0 to 725
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_key  726 non-null    object
 1   division   726 non-null    object
 2   district   726 non-null    object
 3   upazila    726 non-null    object
dtypes: object(4)
memory usage: 22.8+ KB

In [14]:
time_data.head()

  time_key              date  hour  day      week  month quarter  year
0   T00001  20-05-2017 14:56    14   20  3rd Week      5      Q2  2017
1   T00002  30-01-2015 22:14    22   30  4th Week      1      Q1  2015
2   T00003  14-03-2020 02:34     2   14  2nd Week      3      Q1  2020
3   T00004  27-04-2018 12:19    12   27  4th Week      4      Q2  2018
4   T00005  14-04-2018 10:43    10   14  2nd Week      4      Q2  2018

In [15]:
time_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99999 entries, 0 to 99998
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time_key  99999 non-null  object
 1   date      99999 non-null  object
 2   hour      99999 non-null  int64
 3   day       99999 non-null  int64
 4   week      99999 non-null  object
 5   month     99999 non-null  int64
 6   quarter   99999 non-null  object
 7   year      99999 non-null  int64
dtypes: int64(4), object(4)
memory usage: 6.1+ MB

In [16]:
trans_data.head()

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

In [17]:
trans_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   payment_key  39 non-null     object
 1   trans_type   39 non-null     object
 2   bank_name    39 non-null     object
dtypes: object(3)
memory usage: 1.0+ KB

In [18]:
item_data.dtypes

item_key        object
item_name       object
desc            object
unit_price     float64
man_country     object
supplier        object
unit            object
dtype: object

In [2]:
import psycopg2
import psycopg2.extras

In [3]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database = "ecomdb",
                                          user = "postgres",
                                          password = "amiIstiaq6045",
                                          host = "127.0.0.1",
                                          port = "5432")
    def getConnection(self):
        print("Connection to DB established!")
        return self.connection

In [4]:
con = PostgresConnection().getConnection()

Connection to DB established!

In [39]:
# import numpy as np
# arr = np.array(trans_data.values)
# trans_data.values.tolist()
# trans_data.values.tolist()
item_data.dtypes

item_key        object
item_name       object
desc            object
unit_price     float64
man_country     object
supplier        object
unit            object
dtype: object

In [30]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.trans_dim(payment_key,trans_type,bank_name) VALUES (%s,%s,%s)"
cur = con.cursor()
# cur.executemany(insert_stmt, trans_data.values)
psycopg2.extras.execute_batch(cur, insert_stmt, trans_data.values)
con.commit()
cur.close()

Connection to DB established!

In [31]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.store_dim(store_key, division, district, upazila) VALUES (%s, %s, %s, %s);"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, store_data.values)
con.commit()
cur.close()

Connection to DB established!

In [46]:
item_data['unit_price'] = pd.to_numeric(item_data['unit_price'])
item_data.head()

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans

In [50]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.item_dim(item_key, item_name, description, unit_price, man_country, supplier, unit) VALUES (%s, %s, %s, %s, %s, %s, %s);"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, item_data.values)
con.commit()
cur.close()

Connection to DB established!

In [56]:
time_data['date'] = time_data['date'].astype('datetime64[ns]')
time_data.dtypes

time_key            object
date        datetime64[ns]
hour                 int64
day                  int64
week                object
month                int64
quarter             object
year                 int64
dtype: object

In [57]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.time_data(time_key, date, hour, day, week, month, quarter, year) VALUES (%s, %s, %s, %s, %s, %s, %s, %s);"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, time_data.values)
con.commit()
cur.close()

Connection to DB established!

In [60]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.customer_dim(coustomer_key, name, contact_no, nid) VALUES (%s,%s,%s,%s);"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, customer_dim.values)
con.commit()
cur.close()

Connection to DB established!

In [66]:
# fact_data['unit_price'] = pd.to_numeric(fact_data['unit_price'])
# fact_data['total_price'] = pd.to_numeric(fact_data['total_price'])
fact_data.dtypes

payment_key       object
coustomer_key     object
time_key          object
item_key          object
store_key         object
quantity           int64
unit              object
unit_price       float64
total_price      float64
dtype: object

In [83]:
con = PostgresConnection().getConnection()
insert_stmt = "INSERT INTO star_schema.fact_table(payment_key, coustomer_key, time_key, item_key, store_key, quantity, unit, unit_price, total_price) VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s);"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
con.commit()
cur.close()

Connection to DB established!

**Q1: Find the division/district/year/month wise total_sale_price joining fact table and respective dimension table. **

division wise total_sale_price joining fact table and store dimension table

In [9]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.division as "Division", SUM(fact_table.total_price) "Total Sale Price" FROM star_schema.fact_table FULL OUTER JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key GROUP BY store_dim.division ORDER BY store_dim.division"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_division = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [10]:
total_price_by_division

     Division  Total Sale Price
0     BARISAL        7520343.75
1  CHITTAGONG       19763595.00
2       DHAKA       40764619.75
3      KHULNA       11311610.50
4    RAJSHAHI       12099196.00
5     RANGPUR        8429836.50
6      SYLHET        5512234.25

district wise total_sale_price joining fact table and store dimension table

In [15]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.total_price) "Total Sale Price" FROM star_schema.fact_table FULL OUTER JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key GROUP BY store_dim.district ORDER BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_district = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [16]:
total_price_by_district

      District  Total Sale Price
0     BAGERHAT        1307651.00
1    BANDARBAN         995360.75
2      BARGUNA         869041.00
3      BARISAL        2897237.75
4        BHOLA        1012205.75
..         ...               ...
59   SIRAJGANJ        1295100.75
60   SUNAMGANJ        1593774.00
61      SYLHET        1727717.25
62     TANGAIL        1774650.25
63  THAKURGAON         729934.25

[64 rows x 2 columns]

year wise total_sale_price joining fact table and Time dimension table

In [17]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY time_data.year
ORDER BY time_data.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_year = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [18]:
total_price_by_year

   Year  Total Sale Price
0  2014       14334731.25
1  2015       15095720.25
2  2016       14976508.25
3  2017       15015806.00
4  2018       15108197.25
5  2019       14949510.25
6  2020       15037190.25
7  2021         883772.25

month wise total_sale_price joining fact table and Time dimension table

In [21]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.month as "Month", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY time_data.month
ORDER BY time_data.month"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_month = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [22]:
total_price_by_month

    Month  Total Sale Price
0       1        9042244.00
1       2        8073877.50
2       3        8939152.00
3       4        8504634.75
4       5        9078002.50
5       6        8556853.00
6       7        9046580.00
7       8        8929475.25
8       9        8724326.50
9      10        8902783.75
10     11        8680026.00
11     12        8923480.50

**Q2: Find the customer/bank/transaction(cash/online) wise total_sale_price joining fact table and respective dimension table **

customer wise total sale price joining fact table and customer dimension table

In [23]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT customer_dim.name as "Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.customer_dim ON customer_dim.coustomer_key = fact_table.coustomer_key
GROUP BY customer_dim.name
ORDER BY customer_dim.name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_customer = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [24]:
total_price_by_customer

              Name  Total Sale Price
0                -          20643.50
1             ????          21142.50
2            ?????          21085.50
3         ????? ??          12288.00
4           ??????          11010.00
...            ...               ...
4530  zeba parveen          11094.50
4531        zeenat          11523.00
4532    zenab khan          10292.25
4533   zina kumari          11193.00
4534       ziyabul           9965.75

[4535 rows x 2 columns]

bank wise total sale price joining fact table and Transaction dimension table

In [25]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.bank_name as "Bank Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY trans_dim.bank_name
ORDER BY trans_dim.bank_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_bank= pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [26]:
total_price_by_bank

                                            Bank Name  Total Sale Price
0                                     AB Bank Limited        2728515.50
1                    Bangladesh Commerce Bank Limited        2730999.25
2                                   Bank Asia Limited        2687142.75
3                          Bengal Commercial Bank Ltd        2704554.25
4                                               Bkash        2689352.50
5                                   BRAC Bank Limited        2705795.75
6                               Citizens Bank Limited        2723215.25
7                                   City Bank Limited        2713952.50
8                   Community Bank Bangladesh Limited        2685751.50
9                                  Dhaka Bank Limited        2728366.00
10                          Dutch-Bangla Bank Limited        2692435.25
11                               Eastern Bank Limited        2687182.25
12                                  IFIC Bank Limited        2699759.75
13                                Jamuna Bank Limited        2689886.50
14                                Meghna Bank Limited        2700528.50
15                            Mercantile Bank Limited        2676578.50
16                               Midland Bank Limited        2688430.25
17                             Modhumoti Bank Limited        2715279.00
18                          Mutual Trust Bank Limited        2670030.50
19                                              Nagad        2699554.50
20                              National Bank Limited        2697294.25
21            National Credit & Commerce Bank Limited        2723363.00
22                                               None        2708515.75
23                                   NRB Bank Limited        2711595.25
24                            NRB Commercial Bank Ltd        2692016.25
25                                NRB Global Bank Ltd        2700088.00
26                                   One Bank Limited        2692043.25
27                                 Padma Bank Limited        2708084.25
28                               Premier Bank Limited        2690828.00
29                                 Prime Bank Limited        2698896.50
30                                Pubali Bank Limited        2682787.50
31                                             Rocket        2720974.50
32                                  Shimanto Bank Ltd        2685805.25
33  South Bangla Agriculture and Commerce Bank Lim...        2728115.25
34                             Southeast Bank Limited        2691275.75
35                              Standard Bank Limited        2727661.00
36                                 Trust Bank Limited        2720807.00
37                         United Commercial Bank Ltd        2696854.75
38                                Uttara Bank Limited        2707120.00

transaction wise total sale price joining fact table and Transaction dimension table

In [27]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.trans_type as "Transaction Type", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY trans_dim.trans_type
ORDER BY trans_dim.trans_type"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_trans_type = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [28]:
total_price_by_trans_type

  Transaction Type  Total Sale Price
0             card       94583038.50
1             cash        2708515.75
2           mobile        8109881.50

Total Sales in Barisal

In [31]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
WHERE store_dim.district = 'BARISAL'
GROUP BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [32]:
total_sales_in_barisal

  District  Total Sales
0  BARISAL       163782

Total Sales in 2015

In [33]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
FULL OUTER JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
WHERE time_data.year = '2015'
GROUP BY time_data.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015 = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [34]:
total_sales_in_2015

   Year  Total Sales
0  2015       859999

Total Sales in 2015 and in Barisal

In [35]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", store_dim.district as "District", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.time_data 
ON time_data.time_key = fact_table.time_key 
JOIN star_schema.store_dim 
ON store_dim.store_key = fact_table.store_key
WHERE time_data.year = '2015'
AND store_dim.district = 'BARISAL'
GROUP BY time_data.year,store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015_and_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [36]:
total_sales_in_2015_and_barisal

   Year District  Total Sales
0  2015  BARISAL        23456